## Central account
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 3 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.log_archive_read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "log_archive_read"  {
      ~ id      = "3459427473" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cbs-log-archive-871282759583/*",
                          - "arn:aws:s3:::cbs-log-archive-871282759583",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "kms:Decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:871282759583:key/c4591f87-9445-4840-acb6-a5569e703c93"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.log_archive_topic_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "log_archive_topic_policy"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "SNS Access Policy"

      + statement {
          + actions   = [
              + "SNS:AddPermission",
              + "SNS:DeleteTopic",
              + "SNS:GetTopicAttributes",
              + "SNS:ListSubscriptionsByTopic",
              + "SNS:Publish",
              + "SNS:RemovePermission",
              + "SNS:SetTopicAttributes",
              + "SNS:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSelfAccess"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "871282759583",
                ]
              + variable = "aws:SourceOwner"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "SNS:ListSubscriptionsByTopic",
              + "SNS:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowLambdaAccess"

          + principals {
              + identifiers = [
                  + "871282759583",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowS3Access"

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:s3:::cbs-log-archive-871282759583",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_iam_policy.log_archive_read will be updated in-place
  ~ resource "aws_iam_policy" "log_archive_read" {
        id        = "arn:aws:iam::871282759583:policy/CbsASEAReaderRole"
        name      = "CbsASEAReaderRole"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cbs-log-archive-871282759583/*",
                          - "arn:aws:s3:::cbs-log-archive-871282759583",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "kms:Decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:871282759583:key/c4591f87-9445-4840-acb6-a5569e703c93"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_kms_key.log_archive_encrypt will be updated in-place
  ~ resource "aws_kms_key" "log_archive_encrypt" {
        id                                 = "c4591f87-9445-4840-acb6-a5569e703c93"
      ~ policy                             = (sensitive)
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_bucket_notification.cbs_transport_lambda will be updated in-place
  ~ resource "aws_s3_bucket_notification" "cbs_transport_lambda" {
        id     = "cbs-log-archive-871282759583"
        # (1 unchanged attribute hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "CbsEvent" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:871282759583:function:CbsTransportLambda" -> null
        }

      + topic {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "CbsEvent"
          + topic_arn = (known after apply)
        }
    }

  # aws_sns_topic.log_archive will be created
  + resource "aws_sns_topic" "log_archive" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "c4591f87-9445-4840-acb6-a5569e703c93"
      + name                        = "log-archive"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-871282759583"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-871282759583"
        }
    }

  # aws_sns_topic_policy.log_archive will be created
  + resource "aws_sns_topic_policy" "log_archive" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.log_archive"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
